#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.storage_itn.azurerm_storage_queue.access_itn will be created
  + resource "azurerm_storage_queue" "access_itn" {
      + id                   = (known after apply)
      + name                 = "access-queue"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfimsst01"
    }

  # module.storage_itn.azurerm_storage_queue.audit_events_itn will be created
  + resource "azurerm_storage_queue" "audit_events_itn" {
      + id                   = (known after apply)
      + name                 = "audit-events"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfimsst01"
    }

  # module.storage_itn.azurerm_storage_queue.audit_events_poison_itn will be created
  + resource "azurerm_storage_queue" "audit_events_poison_itn" {
      + id                   = (known after apply)
      + name                 = "audit-events-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfimsst01"
    }

  # module.storage_itn.azurerm_storage_queue.config_itn will be created
  + resource "azurerm_storage_queue" "config_itn" {
      + id                   = (known after apply)
      + name                 = "config-queue"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfimsst01"
    }

  # module.storage_itn.azurerm_storage_queue.export_itn will be created
  + resource "azurerm_storage_queue" "export_itn" {
      + id                   = (known after apply)
      + name                 = "export-queue"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnfimsst01"
    }

  # module.storage_itn.module.storage_account_fims_itn.azurerm_private_endpoint.this["queue"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-fims-queue-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-fims-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-fims-queue-pep-01"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmos.module.comsosdb_sql_container_op_access_tokens.azurerm_cosmosdb_sql_container.this,
  on .terraform/modules/cosmos.comsosdb_sql_container_op_access_tokens/cosmosdb_sql_container/main.tf line 7, in resource "azurerm_cosmosdb_sql_container" "this":
   7:   partition_key_path = var.partition_key_path

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and 14 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmos.cosmosdb_account_fims/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
